gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/touch/aw93305/Inc/aw933xx_reg.h
#ifndef __AW933XX_REG_H__
#define __AW933XX_REG_H__
#ifdef __cplusplus
extern "C" {
#endif

#define AFE_BASE_ADDR					(0x0000)
#define DSP_BASE_ADDR					(0x0000)
#define DSPEX_BASE_ADDR					(0x0000)
#define STAT_BASE_ADDR					(0x0000)
#define DATA_BASE_ADDR					(0x0000)
#define CAP_BASE_ADDR					(0x1628)
#define SFR_BASE_ADDR					(0x0000)
/* registers list */
//AW93312_AFE MAP
#define REG_SCANCTRL0					((0x0000) + AFE_BASE_ADDR)
#define REG_SCANCTRL1					((0x0004) + AFE_BASE_ADDR)
#define REG_SCANCTRL2					((0x0008) + AFE_BASE_ADDR)
#define REG_SCANCTRL3					((0x000C) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH0				((0x0168) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH0					((0x0170) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH0					((0x0174) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH0					((0x017C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH0					((0x0180) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH0					((0x0184) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH0					((0x0188) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH1				((0x0318) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH1					((0x0320) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH1					((0x0324) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH1					((0x032C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH1					((0x0330) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH1					((0x0334) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH1					((0x0338) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH2				((0x04C8) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH2					((0x04D0) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH2					((0x04D4) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH2					((0x04DC) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH2					((0x04E0) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH2					((0x04E4) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH2					((0x04E8) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH3				((0x0678) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH3					((0x0680) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH3					((0x0684) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH3					((0x068C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH3					((0x0690) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH3					((0x0694) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH3					((0x0698) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH4				((0x0828) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH4					((0x0830) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH4					((0x0834) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH4					((0x083C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH4					((0x0840) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH4					((0x0844) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH4					((0x0848) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH5				((0x09D8) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH5					((0x09E0) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH5					((0x09E4) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH5					((0x09EC) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH5					((0x09F0) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH5					((0x09F4) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH5					((0x09F8) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH6				((0x0B88) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH6					((0x0B90) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH6					((0x0B94) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH6					((0x0B9C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH6					((0x0BA0) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH6					((0x0BA4) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH6					((0x0BA8) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH7				((0x0D38) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH7					((0x0D40) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH7					((0x0D44) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH7					((0x0D4C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH7					((0x0D50) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH7					((0x0D54) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH7					((0x0D58) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH8				((0x0EE8) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH8					((0x0EF0) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH8					((0x0EF4) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH8					((0x0EFC) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH8					((0x0F00) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH8					((0x0F04) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH8					((0x0F08) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH9				((0x1098) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH9					((0x10A0) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH9					((0x10A4) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH9					((0x10AC) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH9					((0x10B0) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH9					((0x10B4) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH9					((0x10B8) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH10				((0x1248) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH10				((0x1250) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH10				((0x1254) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH10				((0x125C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH10				((0x1260) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH10				((0x1264) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH10				((0x1268) + AFE_BASE_ADDR)
#define REG_AFESOFTCFG0_CH11				((0x13F8) + AFE_BASE_ADDR)
#define REG_AFECFG0_CH11				((0x1400) + AFE_BASE_ADDR)
#define REG_AFECFG1_CH11				((0x1404) + AFE_BASE_ADDR)
#define REG_AFECFG3_CH11				((0x140C) + AFE_BASE_ADDR)
#define REG_AFECFG4_CH11				((0x1410) + AFE_BASE_ADDR)
#define REG_CHLSEL0_CH11				((0x1414) + AFE_BASE_ADDR)
#define REG_CHLSEL1_CH11				((0x1418) + AFE_BASE_ADDR)

/* registers list */
//AW93312_DSP MAP
#define REG_FILTCTRL0_CH0				((0x018C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH0				((0x0190) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH0				((0x0198) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH0					((0x019C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH0				((0x01A4) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH0					((0x01A8) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH0				((0x01C0) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH0				((0x01C4) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH1				((0x033C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH1				((0x0340) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH1				((0x0348) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH1					((0x034C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH1				((0x0354) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH1					((0x0358) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH1				((0x0370) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH1				((0x0374) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH2				((0x04EC) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH2				((0x04F0) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH2				((0x04F8) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH2					((0x04FC) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH2				((0x0504) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH2					((0x0508) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH2				((0x0520) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH2				((0x0524) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH3				((0x069C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH3				((0x06A0) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH3				((0x06A8) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH3					((0x06AC) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH3				((0x06B4) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH3					((0x06B8) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH3				((0x06D0) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH3				((0x06D4) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH4				((0x084C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH4				((0x0850) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH4				((0x0858) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH4					((0x085C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH4				((0x0864) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH4					((0x0868) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH4				((0x0880) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH4				((0x0884) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH5				((0x09FC) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH5				((0x0A00) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH5				((0x0A08) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH5					((0x0A0C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH5				((0x0A14) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH5					((0x0A18) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH5				((0x0A30) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH5				((0x0A34) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH6				((0x0BAC) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH6				((0x0BB0) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH6				((0x0BB8) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH6					((0x0BBC) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH6				((0x0BC4) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH6					((0x0BC8) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH6				((0x0BE0) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH6				((0x0BE4) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH7				((0x0D5C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH7				((0x0D60) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH7				((0x0D68) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH7					((0x0D6C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH7				((0x0D74) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH7					((0x0D78) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH7				((0x0D90) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH7				((0x0D94) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH8				((0x0F0C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH8				((0x0F10) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH8				((0x0F18) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH8					((0x0F1C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH8				((0x0F24) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH8					((0x0F28) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH8				((0x0F40) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH8				((0x0F44) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH9				((0x10BC) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH9				((0x10C0) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH9				((0x10C8) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH9					((0x10CC) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH9				((0x10D4) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH9					((0x10D8) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH9				((0x10F0) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH9				((0x10F4) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH10				((0x126C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH10				((0x1270) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH10				((0x1278) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH10				((0x127C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH10				((0x1284) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH10				((0x1288) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH10				((0x12A0) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH10				((0x12A4) + DSP_BASE_ADDR)
#define REG_FILTCTRL0_CH11				((0x141C) + DSP_BASE_ADDR)
#define REG_REFACOEF_CH11				((0x1420) + DSP_BASE_ADDR)
#define REG_FILTCTRL1_CH11				((0x1428) + DSP_BASE_ADDR)
#define REG_BLFILTA_CH11				((0x142C) + DSP_BASE_ADDR)
#define REG_PROXCTRL_CH11				((0x1434) + DSP_BASE_ADDR)
#define REG_PROXTH0_CH11				((0x1438) + DSP_BASE_ADDR)
#define REG_INITPROX0_CH11				((0x1450) + DSP_BASE_ADDR)
#define REG_INITPROX1_CH11				((0x1454) + DSP_BASE_ADDR)

