gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/touch/aw93305/Inc/aw933xx_reg.h
/* registers list */
//AW93312_DSPEX MAP
#define REG_REFRAWTH_CH0				((0x01F8) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH0				((0x01FC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH0				((0x0200) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH0				((0x0204) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH0				((0x0208) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH0					((0x020C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH0				((0x0210) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH0					((0x0214) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH0				((0x0218) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH0				((0x021C) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH1				((0x03A8) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH1				((0x03AC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH1				((0x03B0) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH1				((0x03B4) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH1				((0x03B8) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH1					((0x03BC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH1				((0x03C0) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH1					((0x03C4) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH1				((0x03C8) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH1				((0x03CC) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH2				((0x0558) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH2				((0x055C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH2				((0x0560) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH2				((0x0564) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH2				((0x0568) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH2					((0x056C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH2				((0x0570) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH2					((0x0574) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH2				((0x0578) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH2				((0x057C) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH3				((0x0708) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH3				((0x070C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH3				((0x0710) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH3				((0x0714) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH3				((0x0718) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH3					((0x071C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH3				((0x0720) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH3					((0x0724) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH3				((0x0728) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH3				((0x072C) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH4				((0x08B8) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH4				((0x08BC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH4				((0x08C0) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH4				((0x08C4) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH4				((0x08C8) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH4					((0x08CC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH4			((0x08D0) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH4					((0x08D4) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH4				((0x08D8) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH4				((0x08DC) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH5				((0x0A68) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH5				((0x0A6C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH5				((0x0A70) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH5				((0x0A74) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH5				((0x0A78) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH5					((0x0A7C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH5				((0x0A80) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH5					((0x0A84) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH5				((0x0A88) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH5				((0x0A8C) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH6				((0x0C18) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH6				((0x0C1C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH6				((0x0C20) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH6				((0x0C24) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH6				((0x0C28) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH6					((0x0C2C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH6				((0x0C30) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH6					((0x0C34) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH6				((0x0C38) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH6				((0x0C3C) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH7				((0x0DC8) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH7				((0x0DCC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH7				((0x0DD0) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH7				((0x0DD4) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH7				((0x0DD8) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH7					((0x0DDC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH7				((0x0DE0) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH7					((0x0DE4) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH7				((0x0DE8) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH7				((0x0DEC) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH8				((0x0F78) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH8				((0x0F7C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH8				((0x0F80) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH8				((0x0F84) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH8				((0x0F88) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH8					((0x0F8C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH8				((0x0F90) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH8					((0x0F94) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH8				((0x0F98) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH8				((0x0F9C) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH9				((0x1128) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH9				((0x112C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH9				((0x1130) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH9				((0x1134) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH9				((0x1138) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH9					((0x113C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH9				((0x1140) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH9					((0x1144) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH9				((0x1148) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH9				((0x114C) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH10				((0x12D8) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH10				((0x12DC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH10				((0x12E0) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH10				((0x12E4) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH10				((0x12E8) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH10					((0x12EC) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH10				((0x12F0) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH10				((0x12F4) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH10				((0x12F8) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH10				((0x12FC) + DSPEX_BASE_ADDR)
#define REG_REFRAWTH_CH11				((0x1488) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMAX_CH11				((0x148C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFMIN_CH11				((0x1490) + DSPEX_BASE_ADDR)
#define REG_REFCOEFINIT_CH11				((0x1494) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLAST_CH11				((0x1498) + DSPEX_BASE_ADDR)
#define REG_REFKP_CH11					((0x149C) + DSPEX_BASE_ADDR)
#define REG_REFCOEFLIMIT_CH11				((0x14A0) + DSPEX_BASE_ADDR)
#define REG_REFCOMP_CH11				((0x14A4) + DSPEX_BASE_ADDR)
#define REG_REFVALIDTAR_CH11				((0x14A8) + DSPEX_BASE_ADDR)
#define REG_REFRAWLAST_CH11				((0x14AC) + DSPEX_BASE_ADDR)

