gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/touch/aw93305/Inc/aw933xx_reg.h
/* registers list */
//AW93312_STAT MAP
#define REG_WST						((0x001C) + STAT_BASE_ADDR)
#define REG_STAT0					((0x0020) + STAT_BASE_ADDR)
#define REG_STAT1					((0x0024) + STAT_BASE_ADDR)
#define REG_STAT7					((0x003C) + STAT_BASE_ADDR)
#define REG_STAT9					((0x0044) + STAT_BASE_ADDR)
#define REG_STAT10					((0x0048) + STAT_BASE_ADDR)
#define REG_CLOSEINTEN					((0x004C) + STAT_BASE_ADDR)
#define REG_FARINTEN					((0x0050) + STAT_BASE_ADDR)
#define REG_FWVER					((0x005C) + STAT_BASE_ADDR)

/* registers list */
//AW93312_DATA MAP
#define REG_VALID_CH0					((0x022C) + DATA_BASE_ADDR)
#define REG_BASELINE_CH0				((0x0230) + DATA_BASE_ADDR)
#define REG_DIFF_CH0					((0x0234) + DATA_BASE_ADDR)
#define REG_RAW_CH0						((0x0250) + DATA_BASE_ADDR)
#define REG_VALID_CH1					((0x03DC) + DATA_BASE_ADDR)
#define REG_BASELINE_CH1				((0x03E0) + DATA_BASE_ADDR)
#define REG_DIFF_CH1					((0x03E4) + DATA_BASE_ADDR)
#define REG_RAW_CH1						((0x0400) + DATA_BASE_ADDR)
#define REG_VALID_CH2					((0x058C) + DATA_BASE_ADDR)
#define REG_BASELINE_CH2				((0x0590) + DATA_BASE_ADDR)
#define REG_DIFF_CH2					((0x0594) + DATA_BASE_ADDR)
#define REG_RAW_CH2						((0x05B0) + DATA_BASE_ADDR)
#define REG_VALID_CH3					((0x073C) + DATA_BASE_ADDR)
#define REG_BASELINE_CH3				((0x0740) + DATA_BASE_ADDR)
#define REG_DIFF_CH3					((0x0744) + DATA_BASE_ADDR)
#define REG_RAW_CH3						((0x0760) + DATA_BASE_ADDR)
#define REG_VALID_CH4					((0x08EC) + DATA_BASE_ADDR)
#define REG_BASELINE_CH4				((0x08F0) + DATA_BASE_ADDR)
#define REG_DIFF_CH4					((0x08F4) + DATA_BASE_ADDR)
#define REG_RAW_CH4						((0x0910) + DATA_BASE_ADDR)
#define REG_VALID_CH5					((0x0A9C) + DATA_BASE_ADDR)
#define REG_BASELINE_CH5				((0x0AA0) + DATA_BASE_ADDR)
#define REG_DIFF_CH5					((0x0AA4) + DATA_BASE_ADDR)
#define REG_RAW_CH5						((0x0AC0) + DATA_BASE_ADDR)
#define REG_VALID_CH6					((0x0C4C) + DATA_BASE_ADDR)
#define REG_BASELINE_CH6				((0x0C50) + DATA_BASE_ADDR)
#define REG_DIFF_CH6					((0x0C54) + DATA_BASE_ADDR)
#define REG_RAW_CH6						((0x0C70) + DATA_BASE_ADDR)
#define REG_VALID_CH7					((0x0DFC) + DATA_BASE_ADDR)
#define REG_BASELINE_CH7				((0x0E00) + DATA_BASE_ADDR)
#define REG_DIFF_CH7					((0x0E04) + DATA_BASE_ADDR)
#define REG_RAW_CH7						((0x0E20) + DATA_BASE_ADDR)
#define REG_VALID_CH8					((0x0FAC) + DATA_BASE_ADDR)
#define REG_BASELINE_CH8				((0x0FB0) + DATA_BASE_ADDR)
#define REG_DIFF_CH8					((0x0FB4) + DATA_BASE_ADDR)
#define REG_RAW_CH8						((0x0FD0) + DATA_BASE_ADDR)
#define REG_VALID_CH9					((0x115C) + DATA_BASE_ADDR)
#define REG_BASELINE_CH9				((0x1160) + DATA_BASE_ADDR)
#define REG_DIFF_CH9					((0x1164) + DATA_BASE_ADDR)
#define REG_RAW_CH9						((0x1180) + DATA_BASE_ADDR)
#define REG_VALID_CH10					((0x130C) + DATA_BASE_ADDR)
#define REG_BASELINE_CH10				((0x1310) + DATA_BASE_ADDR)
#define REG_DIFF_CH10					((0x1314) + DATA_BASE_ADDR)
#define REG_RAW_CH10					((0x1330) + DATA_BASE_ADDR)
#define REG_VALID_CH11					((0x14BC) + DATA_BASE_ADDR)
#define REG_BASELINE_CH11				((0x14C0) + DATA_BASE_ADDR)
#define REG_DIFF_CH11					((0x14C4) + DATA_BASE_ADDR)
#define REG_RAW_CH11					((0x14E0) + DATA_BASE_ADDR)
#define REG_PSCBD_CH0					((0x0264) + DATA_BASE_ADDR)


/* registers list */
//AW93312_CAP MAP
#define REG_TOUCH_TH_X_SLD0				((0x0000) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD0				((0x0004) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD0				((0x0008) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD0				((0x000C) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD0				((0x0010) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD0				((0x0014) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD0				((0x0018) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD0				((0x001C) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD0				((0x0020) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD0			((0x0030) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD0			((0x0034) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD0				((0x0038) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD0				((0x003C) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD0				((0x0040) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD0				((0x0044) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD0				((0x0048) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD0				((0x004C) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD0				((0x0050) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD0				((0x0054) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD1				((0x005C) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD1				((0x0060) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD1				((0x0064) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD1				((0x0068) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD1				((0x006C) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD1				((0x0070) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD1				((0x0074) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD1				((0x0078) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD1				((0x007C) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD1			((0x008C) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD1			((0x0090) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD1				((0x0094) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD1				((0x0098) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD1				((0x009C) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD1				((0x00A0) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD1				((0x00A4) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD1				((0x00A8) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD1				((0x00AC) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD1				((0x00B0) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD2				((0x00B8) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD2				((0x00BC) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD2				((0x00C0) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD2				((0x00C4) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD2				((0x00C8) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD2				((0x00CC) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD2				((0x00D0) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD2				((0x00D4) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD2				((0x00D8) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD2			((0x00E8) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD2			((0x00EC) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD2				((0x00F0) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD2				((0x00F4) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD2				((0x00F8) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD2				((0x00FC) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD2				((0x0100) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD2				((0x0104) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD2				((0x0108) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD2				((0x010C) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD3				((0x0114) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD3				((0x0118) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD3				((0x011C) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD3				((0x0120) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD3				((0x0124) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD3				((0x0128) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD3				((0x012C) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD3				((0x0130) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD3				((0x0134) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD3			((0x0144) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD3			((0x0148) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD3				((0x014C) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD3				((0x0150) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD3				((0x0154) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD3				((0x0158) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD3				((0x015C) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD3				((0x0160) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD3				((0x0164) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD3				((0x0168) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD4				((0x0170) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD4				((0x0174) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD4				((0x0178) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD4				((0x017C) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD4				((0x0180) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD4				((0x0184) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD4				((0x0188) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD4				((0x018C) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD4				((0x0190) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD4			((0x01A0) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD4			((0x01A4) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD4				((0x01A8) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD4				((0x01AC) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD4				((0x01B0) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD4				((0x01B4) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD4				((0x01B8) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD4				((0x01BC) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD4				((0x01C0) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD4				((0x01C4) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD5				((0x01CC) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD5				((0x01D0) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD5				((0x01D4) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD5				((0x01D8) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD5				((0x01DC) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD5				((0x01E0) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD5				((0x01E4) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD5				((0x01E8) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD5				((0x01EC) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD5			((0x01FC) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD5			((0x0200) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD5				((0x0204) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD5				((0x0208) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD5				((0x020C) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD5				((0x0210) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD5				((0x0214) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD5				((0x0218) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD5				((0x021C) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD5				((0x0220) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD6				((0x0228) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD6				((0x022C) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD6				((0x0230) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD6				((0x0234) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD6				((0x0238) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD6				((0x023C) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD6				((0x0240) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD6				((0x0244) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD6				((0x0248) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD6			((0x0258) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD6			((0x025C) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD6				((0x0260) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD6				((0x0264) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD6				((0x0268) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD6				((0x026C) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD6				((0x0270) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD6				((0x0274) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD6				((0x0278) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD6				((0x027C) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD7				((0x0284) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD7				((0x0288) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD7				((0x028C) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD7				((0x0290) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD7				((0x0294) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD7				((0x0298) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD7				((0x029C) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD7				((0x02A0) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD7				((0x02A4) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD7			((0x02B4) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD7			((0x02B8) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD7				((0x02BC) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD7				((0x02C0) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD7				((0x02C4) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD7				((0x02C8) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD7				((0x02CC) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD7				((0x02D0) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD7				((0x02D4) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD7				((0x02D8) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD8				((0x02E0) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD8				((0x02E4) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD8				((0x02E8) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD8				((0x02EC) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD8				((0x02F0) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD8				((0x02F4) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD8				((0x02F8) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD8				((0x02FC) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD8				((0x0300) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD8			((0x0310) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD8			((0x0314) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD8				((0x0318) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD8				((0x031C) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD8				((0x0320) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD8				((0x0324) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD8				((0x0328) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD8				((0x032C) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD8				((0x0330) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD8				((0x0334) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD9				((0x033C) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD9				((0x0340) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD9				((0x0344) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD9				((0x0348) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD9				((0x034C) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD9				((0x0350) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD9				((0x0354) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD9				((0x0358) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD9				((0x035C) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD9			((0x036C) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD9			((0x0370) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD9				((0x0374) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD9				((0x0378) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD9				((0x037C) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD9				((0x0380) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD9				((0x0384) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD9				((0x0388) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD9				((0x038C) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD9				((0x0390) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD10				((0x0398) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD10				((0x039C) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD10				((0x03A0) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD10				((0x03A4) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD10				((0x03A8) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD10				((0x03AC) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD10			((0x03B0) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD10			((0x03B4) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD10				((0x03B8) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD10			((0x03C8) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD10			((0x03CC) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD10				((0x03D0) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD10				((0x03D4) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD10				((0x03D8) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD10				((0x03DC) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD10				((0x03E0) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD10				((0x03E4) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD10				((0x03E8) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD10				((0x03EC) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_X_SLD11				((0x03F4) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_X_SLD11				((0x03F8) + CAP_BASE_ADDR)
#define REG_TOUCH_TH_Y_SLD11				((0x03FC) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_Y_SLD11				((0x0400) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG0_SLD11				((0x0404) + CAP_BASE_ADDR)
#define REG_BUTTON_CFG1_SLD11				((0x0408) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG0_SLD11			((0x040C) + CAP_BASE_ADDR)
#define REG_LONGPRESS_CFG1_SLD11			((0x0410) + CAP_BASE_ADDR)
#define REG_BUTTON_STATE_SLD11				((0x0414) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_X_SLD11			((0x0424) + CAP_BASE_ADDR)
#define REG_POS_CALCULATE_TH_Y_SLD11			((0x0428) + CAP_BASE_ADDR)
#define REG_SLD_CFG_SLD11				((0x042C) + CAP_BASE_ADDR)
#define REG_SLD_DATA_SLD11				((0x0430) + CAP_BASE_ADDR)
#define REG_SLD_LIMIT_TH_SLD11				((0x0434) + CAP_BASE_ADDR)
#define REG_FIRST_POS_SLD11				((0x0438) + CAP_BASE_ADDR)
#define REG_NOW_POS_SLD11				((0x043C) + CAP_BASE_ADDR)
#define REG_PER_POS_SLD11				((0x0440) + CAP_BASE_ADDR)
#define REG_MOVE_DISTANCE_SLD11				((0x0444) + CAP_BASE_ADDR)
#define REG_BAR_REPORT_SLD11				((0x0448) + CAP_BASE_ADDR)
#define REG_WEAR_CFG					((0x0450) + CAP_BASE_ADDR)
#define REG_WEAR_STATE					((0x0454) + CAP_BASE_ADDR)
#define REG_PROX_TH_WEAR0				((0x0458) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_WEAR0				((0x045C) + CAP_BASE_ADDR)
#define REG_DELTA_UP_TH_WEAR0				((0x0460) + CAP_BASE_ADDR)
#define REG_DELTA_DOWN_TH_WEAR0				((0x0464) + CAP_BASE_ADDR)
#define REG_STD_ERR_TH_WEAR0				((0x0468) + CAP_BASE_ADDR)
#define REG_PROX_TH_WEAR1				((0x04C4) + CAP_BASE_ADDR)
#define REG_LEAVE_TH_WEAR1				((0x04C8) + CAP_BASE_ADDR)
#define REG_DELTA_UP_TH_WEAR1				((0x04CC) + CAP_BASE_ADDR)
#define REG_DELTA_DOWN_TH_WEAR1				((0x04D0) + CAP_BASE_ADDR)
#define REG_STD_ERR_TH_WEAR1				((0x04D4) + CAP_BASE_ADDR)
#define REG_CONTROL_NUM					((0x0534) + CAP_BASE_ADDR)

