gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/touch/aw93305/Inc/aw933xx_reg.h
/* registers list */
//AW93312_SFR MAP
#define REG_CMD					((0xF008) + SFR_BASE_ADDR)
#define REG_IRQSRC					((0xF080) + SFR_BASE_ADDR)
#define REG_IRQEN					((0xF084) + SFR_BASE_ADDR)
#define REG_I2CTIMEOUTEN				((0xF0E4) + SFR_BASE_ADDR)
#define REG_ANACFG					((0xF804) + SFR_BASE_ADDR)
#define REG_CHIPSTAT					((0xFF00) + SFR_BASE_ADDR)
#define REG_CHIP_ID0					((0xFF10) + SFR_BASE_ADDR)
#define REG_CHIP_ID1					((0xFF14) + SFR_BASE_ADDR)
#define REG_CHIP_ID2					((0xFF20) + SFR_BASE_ADDR)
#define REG_I3C_OSC_EN					((0xFF40) + SFR_BASE_ADDR)

#define REG_MFP00						(0xC100)
#define REG_GPIODIR						(0xE004)
#define REG_GPIORDATA					(0xE008)
#define REG_GPIOIBE						(0xE00C)
#define REG_GPIOPU						(0xE010)
#define REG_GPIOPD						(0xE014)
#define REG_ACCESS_APB_EN				(0xFFF4)

/* for AW933XX_EVB_DB_V2.0	AW93312*/
const unsigned int aw933xx_default_reg[] = {
	0x0000, 0x0000003F,
	0x0004, 0x0000003F,
	0x0008, 0x00000FFF,
	0x000C, 0x00000014,
	0x0168, 0x00000000,
	0x0170, 0x00053000,
	0x0174, 0x00000000,
	0x017C, 0x00008000,
	0x0180, 0x00000909,
	0x0184, 0x00008000,
	0x0188, 0x00000000,
	0x0318, 0x00000000,
	0x0320, 0x00053000,
	0x0324, 0x00000000,
	0x032C, 0x00008000,
	0x0330, 0x00000909,
	0x0334, 0x08000000,
	0x0338, 0x00000000,
	0x04C8, 0x00000000,
	0x04D0, 0x00053000,
	0x04D4, 0x00000000,
	0x04DC, 0x00008000,
	0x04E0, 0x00000909,
	0x04E4, 0x00000008,
	0x04E8, 0x00000000,
	0x0678, 0x00000000,
	0x0680, 0x00053000,
	0x0684, 0x00000000,
	0x068C, 0x00008000,
	0x0690, 0x00000909,
	0x0694, 0x00000001,
	0x0698, 0x00000000,
	0x0828, 0x00000000,
	0x0830, 0x00053000,
	0x0834, 0x00000000,
	0x083C, 0x00008000,
	0x0840, 0x00000909,
	0x0844, 0x00000000,
	0x0848, 0x00000001,
	0x09D8, 0x00000000,
	0x09E0, 0x00053000,
	0x09E4, 0x00000000,
	0x09EC, 0x00008000,
	0x09F0, 0x00000909,
	0x09F4, 0x00000200,
	0x09F8, 0x00000000,
	0x0B88, 0x00000000,
	0x0B90, 0x00050000,
	0x0B94, 0x00000000,
	0x0B9C, 0x00008000,
	0x0BA0, 0x00000909,
	0x0BA4, 0x00000000,
	0x0BA8, 0x00000000,
	0x0D38, 0x00000000,
	0x0D40, 0x00050000,
	0x0D44, 0x00000000,
	0x0D4C, 0x00008000,
	0x0D50, 0x00000909,
	0x0D54, 0x00000000,
	0x0D58, 0x00000000,
	0x0EE8, 0x00000000,
	0x0EF0, 0x00050000,
	0x0EF4, 0x00000000,
	0x0EFC, 0x00008000,
	0x0F00, 0x00000909,
	0x0F04, 0x00000000,
	0x0F08, 0x00000000,
	0x1098, 0x00000000,
	0x10A0, 0x00050000,
	0x10A4, 0x00000000,
	0x10AC, 0x00008000,
	0x10B0, 0x00000909,
	0x10B4, 0x00000000,
	0x10B8, 0x00000000,
	0x1248, 0x00000000,
	0x1250, 0x00050000,
	0x1254, 0x00000000,
	0x125C, 0x00008000,
	0x1260, 0x00000909,
	0x1264, 0x00000000,
	0x1268, 0x00000000,
	0x13F8, 0x00000000,
	0x1400, 0x00050000,
	0x1404, 0x00000000,
	0x140C, 0x00008000,
	0x1410, 0x00000909,
	0x1414, 0x00000000,
	0x1418, 0x00000000,
	0x1628, 0x0000C350,
	0x162C, 0x00000000,
	0x1630, 0x0000C350,
	0x1634, 0x00000000,
	0x1638, 0x02170400,
	0x163C, 0x001401F4,
	0x1640, 0x0BB807D0,
	0x1644, 0x00000FA0,
	0x1658, 0x0000C350,
	0x165C, 0x0000C350,
	0x1660, 0x80000300,
	0x1668, 0x00000000,
	0x1684, 0x0000C350,
	0x1688, 0x00000000,
	0x168C, 0x0000C350,
	0x1690, 0x00000000,
	0x1694, 0x01170104,
	0x1698, 0x001401F4,
	0x169C, 0x0BB807D0,
	0x16A0, 0x00000FA0,
	0x16B4, 0x0000C350,
	0x16B8, 0x0000C350,
	0x16BC, 0x00000300,
	0x16C4, 0x00000000,
	0x16E0, 0x0000C350,
	0x16E4, 0x00000000,
	0x16E8, 0x0000C350,
	0x16EC, 0x00000000,
	0x16F0, 0x00170000,
	0x16F4, 0x001401F4,
	0x16F8, 0x0BB807D0,
	0x16FC, 0x00000FA0,
	0x1710, 0x0000C350,
	0x1714, 0x0000C350,
	0x1718, 0x00000300,
	0x1720, 0x00000000,
	0x173C, 0x0000C350,
	0x1740, 0x00000000,
	0x1744, 0x0000C350,
	0x1748, 0x00000000,
	0x174C, 0x00170000,
	0x1750, 0x001401F4,
	0x1754, 0x0BB807D0,
	0x1758, 0x00000FA0,
	0x176C, 0x0000C350,
	0x1770, 0x0000C350,
	0x1774, 0x00000300,
	0x177C, 0x00000000,
	0x1798, 0x0000C350,
	0x179C, 0x00000000,
	0x17A0, 0x0000C350,
	0x17A4, 0x00000000,
	0x17A8, 0x00170000,
	0x17AC, 0x001401F4,
	0x17B0, 0x0BB807D0,
	0x17B4, 0x00000FA0,
	0x17C8, 0x0000C350,
	0x17CC, 0x0000C350,
	0x17D0, 0x00000300,
	0x17D8, 0x00000000,
	0x17F4, 0x0000C350,
	0x17F8, 0x00000000,
	0x17FC, 0x0000C350,
	0x1800, 0x00000000,
	0x1804, 0x00170000,
	0x1808, 0x001401F4,
	0x180C, 0x0BB807D0,
	0x1810, 0x00000FA0,
	0x1824, 0x0000C350,
	0x1828, 0x0000C350,
	0x182C, 0x00000300,
	0x1834, 0x00000000,
	0x1850, 0x0000C350,
	0x1854, 0x00000000,
	0x1858, 0x0000C350,
	0x185C, 0x00000000,
	0x1860, 0x00170000,
	0x1864, 0x001401F4,
	0x1868, 0x0BB807D0,
	0x186C, 0x00000FA0,
	0x1880, 0x0000C350,
	0x1884, 0x0000C350,
	0x1888, 0x00000300,
	0x1890, 0x00000000,
	0x18AC, 0x0000C350,
	0x18B0, 0x00000000,
	0x18B4, 0x0000C350,
	0x18B8, 0x00000000,
	0x18BC, 0x00170000,
	0x18C0, 0x001401F4,
	0x18C4, 0x0BB807D0,
	0x18C8, 0x00000FA0,
	0x18DC, 0x0000C350,
	0x18E0, 0x0000C350,
	0x18E4, 0x00000300,
	0x18EC, 0x00000000,
	0x1908, 0x0000C350,
	0x190C, 0x00000000,
	0x1910, 0x0000C350,
	0x1914, 0x00000000,
	0x1918, 0x00170000,
	0x191C, 0x001401F4,
	0x1920, 0x0BB807D0,
	0x1924, 0x00000FA0,
	0x1938, 0x0000C350,
	0x193C, 0x0000C350,
	0x1940, 0x00000300,
	0x1948, 0x00000000,
	0x1964, 0x0000C350,
	0x1968, 0x00000000,
	0x196C, 0x0000C350,
	0x1970, 0x00000000,
	0x1974, 0x00170000,
	0x1978, 0x001401F4,
	0x197C, 0x0BB807D0,
	0x1980, 0x00000FA0,
	0x1994, 0x0000C350,
	0x1998, 0x0000C350,
	0x199C, 0x00000300,
	0x19A4, 0x00000000,
	0x19C0, 0x0000C350,
	0x19C4, 0x00000000,
	0x19C8, 0x0000C350,
	0x19CC, 0x00000000,
	0x19D0, 0x00170000,
	0x19D4, 0x001401F4,
	0x19D8, 0x0BB807D0,
	0x19DC, 0x00000FA0,
	0x19F0, 0x0000C350,
	0x19F4, 0x0000C350,
	0x19F8, 0x00000300,
	0x1A00, 0x00000000,
	0x1A1C, 0x0000C350,
	0x1A20, 0x00000000,
	0x1A24, 0x0000C350,
	0x1A28, 0x00000000,
	0x1A2C, 0x00170000,
	0x1A30, 0x001401F4,
	0x1A34, 0x0BB807D0,
	0x1A38, 0x00000FA0,
	0x1A4C, 0x0000C350,
	0x1A50, 0x0000C350,
	0x1A54, 0x00000300,
	0x1A5C, 0x00000000,
	0x1A78, 0x01058000,
	0x1A80, 0x0000C350,
	0x1A84, 0x0000C350,
	0x1ABC, 0x0000C350,
	0x1AC0, 0x0000C350,
	0x018C, 0x00000000,
	0x0190, 0x00000000,
	0x0198, 0x00000000,
	0x019C, 0x000008D0,
	0x01A4, 0x00000000,
	0x01A8, 0x0000C350,
	0x01AC, 0x000186A0,
	0x033C, 0x00000000,
	0x0340, 0x00000000,
	0x0348, 0x00000000,
	0x034C, 0x000008D0,
	0x0354, 0x00000000,
	0x0358, 0x0000C350,
	0x035C, 0x000186A0,
	0x04EC, 0x00000000,
	0x04F0, 0x00000000,
	0x04F8, 0x00000000,
	0x04FC, 0x000008D0,
	0x0504, 0x00000000,
	0x0508, 0x0000C350,
	0x050C, 0x000186A0,
	0x069C, 0x00000000,
	0x06A0, 0x00000000,
	0x06A8, 0x00000000,
	0x06AC, 0x000008D0,
	0x06B4, 0x00000000,
	0x06B8, 0x0000C350,
	0x06BC, 0x000186A0,
	0x084C, 0x00000000,
	0x0850, 0x00000000,
	0x0858, 0x00000000,
	0x085C, 0x000008D0,
	0x0864, 0x00000000,
	0x0868, 0x0000C350,
	0x086C, 0x000186A0,
	0x09FC, 0x00000000,
	0x0A00, 0x00000000,
	0x0A08, 0x00000000,
	0x0A0C, 0x000008D0,
	0x0A14, 0x00000000,
	0x0A18, 0x0000C350,
	0x0A1C, 0x000186A0,
	0x0BAC, 0x00000000,
	0x0BB0, 0x00000000,
	0x0BB8, 0x00000000,
	0x0BBC, 0x000008D0,
	0x0BC4, 0x00000000,
	0x0BC8, 0x0000C350,
	0x0BCC, 0x00000000,
	0x0D5C, 0x00000000,
	0x0D60, 0x00000000,
	0x0D68, 0x00000000,
	0x0D6C, 0x000008D0,
	0x0D74, 0x00000000,
	0x0D78, 0x0000C350,
	0x0D7C, 0x00000000,
	0x0F0C, 0x00000000,
	0x0F10, 0x00000000,
	0x0F18, 0x00000000,
	0x0F1C, 0x000008D0,
	0x0F24, 0x00000000,
	0x0F28, 0x0000C350,
	0x0F2C, 0x00000000,
	0x10BC, 0x00000000,
	0x10C0, 0x00000000,
	0x10C8, 0x00000000,
	0x10CC, 0x000008D0,
	0x10D4, 0x00000000,
	0x10D8, 0x0000C350,
	0x10DC, 0x00000000,
	0x126C, 0x00000000,
	0x1270, 0x00000000,
	0x1278, 0x00000000,
	0x127C, 0x000008D0,
	0x1284, 0x00000000,
	0x1288, 0x0000C350,
	0x128C, 0x00000000,
	0x141C, 0x00000000,
	0x1420, 0x00000000,
	0x1428, 0x00000000,
	0x142C, 0x000008D0,
	0x1434, 0x00000000,
	0x1438, 0x0000C350,
	0x143C, 0x00000000,
	0x01D4, 0x00000000,
	0x01E4, 0xFFFFFFFF,
	0x0384, 0x00000000,
	0x0394, 0xFFFFFFFF,
	0x0534, 0x00000000,
	0x0544, 0xFFFFFFFF,
	0x06E4, 0x00000000,
	0x06F4, 0xFFFFFFFF,
	0x0894, 0x00000000,
	0x08A4, 0xFFFFFFFF,
	0x0A44, 0x00000000,
	0x0A54, 0xFFFFFFFF,
	0x0BF4, 0x00000000,
	0x0C04, 0xFFFFFFFF,
	0x0DA4, 0x00000000,
	0x0DB4, 0xFFFFFFFF,
	0x0F54, 0x00000000,
	0x0F64, 0xFFFFFFFF,
	0x1104, 0x00000000,
	0x1114, 0xFFFFFFFF,
	0x12B4, 0x00000000,
	0x12C4, 0xFFFFFFFF,
	0x1464, 0x00000000,
	0x1474, 0xFFFFFFFF,
	0xF084, 0x000F0FFF,
	0x004C, 0xFFFFFFFF,
	0x0050, 0xFFFFFFFF,
};

