gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_pca9420/component/touch/aw93305/Inc/aw933xx_reg.h
	0x6B, 0x82, 0xB5, 0x10, 0xD0, 0x02, 0x07, 0x11, 0x0F, 0x09, 0x07, 0x11,
	0x21, 0x02, 0xE0, 0x00, 0x18, 0x41, 0x23, 0x00, 0x65, 0x43, 0x31, 0x40,
	0x06, 0x89, 0x7E, 0x09, 0x65, 0x43, 0x0C, 0x0B, 0x00, 0x8C, 0x69, 0x01,
	0xD5, 0x0E, 0x6A, 0x01, 0xDA, 0x01, 0x29, 0x00, 0xDB, 0x0A, 0x2A, 0x00,
	0x0F, 0x52, 0x06, 0xCA, 0x3A, 0x10, 0x01, 0x12, 0x0D, 0x92, 0x05, 0x92,
	0x01, 0x24, 0x24, 0x3F, 0x43, 0x1A, 0x43, 0xA3, 0x6D, 0x42, 0x65, 0x42,
	0x01, 0x12, 0x09, 0x12, 0x22, 0x01, 0x65, 0x42, 0x43, 0x11, 0x04, 0x12,
	0xF7, 0xFF, 0x62, 0x01, 0xBD, 0x10, 0xFD, 0x55, 0x8A, 0x02, 0xB5, 0xFC,
	0x05, 0x13, 0x21, 0x00, 0x04, 0x12, 0xB2, 0xD5, 0x0F, 0x1E, 0x0F, 0x12,
	0x34, 0x40, 0x46, 0x04, 0xE0, 0x1C, 0x92, 0x01, 0x6A, 0xC3, 0x00, 0x8A,
	0x58, 0x9A, 0x92, 0x00, 0x46, 0x9C, 0x19, 0x4B, 0x00, 0x9B, 0x4F, 0x1C,
	0x46, 0x9E, 0x58, 0xFF, 0xDD, 0x0E, 0x42, 0xBA, 0x42, 0xBA, 0x68, 0x07,
	0x4F, 0x18, 0xDD, 0x0B, 0x89, 0x22, 0x46, 0x63, 0x37, 0x30, 0x00, 0x5B,
	0x6A, 0xC3, 0x52, 0xFA, 0x3F, 0x30, 0x9A, 0x00, 0x46, 0x72, 0x58, 0x9B,
	0x1C, 0x49, 0x50, 0xBB, 0x42, 0xB1, 0xB2, 0xC9, 0x9A, 0x01, 0xD3, 0xE0,
	0x46, 0x96, 0x18, 0xB2, 0xD9, 0x19, 0x45, 0x8E, 0x6A, 0xC3, 0x00, 0x8A,
	0x58, 0x9A, 0x46, 0x94, 0x4F, 0x0B, 0x19, 0x4E, 0x58, 0xFF, 0x00, 0xB3,
	0xDD, 0x0C, 0x42, 0xBA, 0x42, 0xBA, 0x68, 0x87, 0x4A, 0x07, 0xDD, 0x09,
	0x89, 0x67, 0x00, 0x76, 0x53, 0x97, 0x32, 0x48, 0x46, 0x66, 0x6A, 0xC2,
	0x4E, 0x03, 0x59, 0x92, 0x1C, 0x49, 0x50, 0xF2, 0xE7, 0xE3, 0xB2, 0xC9,
	0x00, 0x00, 0xBD, 0xFC, 0x20, 0x00, 0x1B, 0x40, 0x4A, 0x02, 0x7C, 0x01,
	0x18, 0x89, 0x00, 0x89, 0x47, 0x70, 0x62, 0xC1, 0x20, 0x00, 0x1B, 0x10,
	0x4A, 0x04, 0x68, 0x01, 0x0E, 0x09, 0x02, 0x09, 0x18, 0x89, 0x00, 0x89,
	0x60, 0x01, 0x30, 0x80, 0x00, 0x00, 0x47, 0x70, 0x20, 0x00, 0x1B, 0x10,
	0x46, 0x07, 0xB5, 0xF8, 0x30, 0xB1, 0x20, 0xFF, 0x43, 0x78, 0x4B, 0x16,
	0x46, 0x33, 0x18, 0xC6, 0x33, 0x81, 0x33, 0xFF, 0x03, 0xC4, 0x6B, 0x98,
	0x29, 0x04, 0xD5, 0x1E, 0x2A, 0x01, 0xD1, 0x1C, 0x2A, 0x02, 0xD0, 0x04,
	0x2A, 0x03, 0xD0, 0x19, 0xE0, 0x00, 0xD1, 0x16, 0xB2, 0xC5, 0x8E, 0x98,
	0x0E, 0x04, 0x04, 0x00, 0xD0, 0x0F, 0x2D, 0x00, 0xD0, 0x0D, 0x2C, 0x00,
	0x46, 0x20, 0x46, 0x29, 0xFB, 0xB2, 0xF7, 0xFF, 0x46, 0x21, 0x46, 0x2A,
	0xF0, 0x01, 0x46, 0x38, 0x36, 0xFF, 0xF9, 0x43, 0x6F, 0xB0, 0x36, 0x01,
	0xFB, 0xA2, 0xF7, 0xFF, 0x6B, 0x58, 0xBD, 0xF8, 0x0E, 0x0D, 0x02, 0x01,
	0x00, 0x00, 0xE7, 0xE7, 0x20, 0x00, 0x00, 0x00, 0x6A, 0x02, 0xB5, 0x10,
	0x0F, 0x09, 0x04, 0x11, 0xD0, 0x04, 0x29, 0x04, 0xD0, 0x05, 0x29, 0x08,
	0xD0, 0x06, 0x29, 0x02, 0xF7, 0xFF, 0xE0, 0x0B, 0xBD, 0x10, 0xFC, 0xC1,
	0xFE, 0x3A, 0xF7, 0xFF, 0x69, 0x01, 0xBD, 0x10, 0xD4, 0x02, 0x00, 0x49,
	0xFF, 0x26, 0xF7, 0xFF, 0x05, 0x11, 0xBD, 0x10, 0xF7, 0xFF, 0xD5, 0xFC,
	0xBD, 0x10, 0xFC, 0xE2, 0x46, 0x0D, 0xB5, 0xF8, 0x24, 0x00, 0x46, 0x06,
	0x43, 0x60, 0x20, 0x5C, 0x46, 0x07, 0x19, 0x80, 0xF8, 0x24, 0xF0, 0x00,
	0x03, 0xC1, 0x6A, 0x38, 0x21, 0x01, 0xD5, 0x08, 0x43, 0x88, 0x04, 0x09,
	0x20, 0x01, 0x62, 0x38, 0x40, 0xA0, 0x68, 0x29, 0x60, 0x29, 0x43, 0x01,
	0xB2, 0xE4, 0x1C, 0x64, 0xD3, 0xE9, 0x2C, 0x0C, 0x01, 0x00, 0x20, 0x45,
	0xF0, 0x00, 0x18, 0x30, 0x20, 0x01, 0xF8, 0x39, 0x18, 0x31, 0x02, 0x80,
	0x00, 0x82, 0x6D, 0x48, 0x22, 0x01, 0xD5, 0x07, 0x43, 0x90, 0x07, 0x52,
	0x68, 0x28, 0x65, 0x48, 0x43, 0x08, 0x14, 0x51, 0xBD, 0xF8, 0x60, 0x28,
	0x00, 0x04, 0xB5, 0x10, 0x69, 0x20, 0xD0, 0x25, 0xD4, 0x05, 0x01, 0x81,
	0xD4, 0x03, 0x01, 0x41, 0xD4, 0x01, 0x01, 0x01, 0xD5, 0x1C, 0x01, 0xC0,
	0xF7, 0xFF, 0x46, 0x20, 0x46, 0x20, 0xFF, 0x5F, 0xFA, 0x14, 0xF0, 0x00,
	0xF7, 0xFF, 0x46, 0x20, 0x69, 0x20, 0xFD, 0x91, 0xD4, 0x02, 0x01, 0xC0,
	0xF0, 0x00, 0x46, 0x20, 0x69, 0x20, 0xF9, 0xF5, 0xDB, 0x02, 0x28, 0x00,
	0xF7, 0xFF, 0x46, 0x20, 0x6A, 0x20, 0xFF, 0x95, 0x46, 0x01, 0x22, 0x02,
	0x43, 0x91, 0x07, 0xC0, 0x43, 0x01, 0x0F, 0x80, 0xBD, 0x10, 0x62, 0x21,
	0x68, 0x01, 0xB5, 0x10, 0x01, 0x08, 0x46, 0x03, 0xD0, 0x07, 0x0F, 0x00,
	0xD5, 0x05, 0x04, 0x08, 0xF7, 0xFF, 0x46, 0x18, 0x46, 0x18, 0xFF, 0x41,
	0xFA, 0x23, 0xF0, 0x00, 0x00, 0x00, 0xBD, 0x10, 0x32, 0xB1, 0x22, 0xFF,
	0x4A, 0x06, 0x43, 0x50, 0x18, 0x80, 0x02, 0xC9, 0x30, 0x81, 0x30, 0xFF,
	0x0D, 0x52, 0x6A, 0x82, 0x0A, 0xC9, 0x05, 0x52, 0x62, 0x82, 0x43, 0x0A,
	0x00, 0x00, 0x47, 0x70, 0x20, 0x00, 0x00, 0x00, 0x69, 0x01, 0xB5, 0xF0,
	0xB2, 0xCA, 0xB0, 0x88, 0x05, 0x09, 0x91, 0x04, 0x91, 0x01, 0x0F, 0x09,
	0x4E, 0x3F, 0x99, 0x04, 0x0F, 0x09, 0x04, 0x09, 0x6A, 0x07, 0x91, 0x00,
	0x07, 0xBB, 0x99, 0x01, 0x93, 0x07, 0x0F, 0xDB, 0x18, 0x51, 0x0F, 0xFB,
	0xB2, 0xC9, 0x93, 0x06, 0x46, 0x8C, 0x46, 0x03, 0x07, 0xF9, 0x33, 0x20,
	0x46, 0xBE, 0x93, 0x03, 0x00, 0x97, 0x7A, 0x9C, 0x59, 0xF7, 0x7A, 0xDB,
	0x46, 0x77, 0x97, 0x05, 0x0F, 0x3F, 0x04, 0x3F, 0x46, 0x15, 0x0F, 0xC9,
	0x29, 0x00, 0x97, 0x02, 0x99, 0x07, 0xD1, 0x04, 0xD0, 0x01, 0x29, 0x00,
	0xD0, 0x01, 0x2F, 0x01, 0xD1, 0x55, 0x2F, 0x08, 0x46, 0x29, 0x9F, 0x01,
	0x97, 0x07, 0x18, 0xBF, 0x4E, 0x29, 0xE0, 0x09, 0x59, 0xF6, 0x00, 0x8F,
	0x42, 0xBE, 0x9F, 0x05, 0x46, 0x0D, 0xDD, 0x01, 0x1C, 0x49, 0x96, 0x05,
	0x9E, 0x07, 0xB2, 0xC9, 0xD8, 0xF2, 0x42, 0x8E, 0x2E, 0x08, 0x9E, 0x02,
	0x9E, 0x06, 0xD0, 0x0E, 0xD1, 0x0D, 0x2E, 0x00, 0xD0, 0x09, 0x2C, 0x00,
	0x42, 0xAC, 0x1C, 0x6D, 0x26, 0x01, 0xD0, 0x08, 0x46, 0x75, 0x24, 0x00,
	0x43, 0x35, 0x07, 0xF6, 0xE0, 0x01, 0x62, 0x05, 0xB2, 0xEC, 0x1C, 0x6D,
	0x72, 0xAC, 0x9D, 0x03, 0x01, 0x64, 0x9C, 0x04, 0x4F, 0x16, 0xD5, 0x2A,
	0x59, 0x3D, 0x00, 0x8C, 0x9C, 0x00, 0x9E, 0x01, 0x18, 0xA2, 0x19, 0x34,
	0x00, 0x8C, 0xE0, 0x07, 0x42, 0xAC, 0x59, 0x3C, 0x46, 0x25, 0xDD, 0x01,
	0x1C, 0x49, 0x46, 0x8C, 0x42, 0x8A, 0xB2, 0xC9, 0x6A, 0x01, 0xD8, 0xF5,
	0x0F, 0x12, 0x04, 0x0A, 0xD0, 0x0E, 0x2A, 0x08, 0x2A, 0x00, 0x9A, 0x06,
	0x2B, 0x00, 0xD1, 0x0E, 0x46, 0x62, 0xD0, 0x09, 0x42, 0x93, 0x1C, 0x52,
	0x22, 0x01, 0xD0, 0x08, 0x07, 0xD2, 0x23, 0x00, 0x62, 0x01, 0x43, 0x11,
	0x46, 0x60, 0xE0, 0x02, 0xB2, 0xC3, 0x1C, 0x40, 0x72, 0xC3, 0x98, 0x03,
	0xBD, 0xF0, 0xB0, 0x08, 0x20, 0x00, 0x1B, 0x40, 0x46, 0x04, 0xB5, 0xF8,
	0x25, 0x00, 0x46, 0x06, 0x5F, 0x60, 0x34, 0x40, 0x8A, 0x30, 0x90, 0x00,
	0x0F, 0x00, 0x04, 0x00, 0x27, 0x02, 0xD0, 0x02, 0xE0, 0x00, 0x5F, 0xE7,
	0x20, 0x10, 0x27, 0x01, 0xF7, 0xFF, 0x5E, 0x20, 0x46, 0x01, 0xFA, 0x63,
	0x42, 0x81, 0x98, 0x00, 0x20, 0x12, 0xDA, 0x0A, 0xF7, 0xFF, 0x5E, 0x20,
	0x42, 0xB8, 0xFA, 0x5B, 0x20, 0x00, 0xDA, 0x04, 0x76, 0x60, 0x76, 0x20,
	0xBD, 0xF8, 0x76, 0xA0, 0x5E, 0x20, 0x20, 0x10, 0xFA, 0x50, 0xF7, 0xFF,
	0x98, 0x00, 0x46, 0x01, 0xDB, 0x08, 0x42, 0x81, 0x5E, 0x20, 0x20, 0x12,
	0xFA, 0x48, 0xF7, 0xFF, 0xDC, 0x02, 0x42, 0xB8, 0x82, 0x60, 0x20, 0x00,
	0x20, 0x10, 0xE0, 0x0F, 0xF7, 0xFF, 0x5E, 0x20, 0x46, 0x01, 0xFA, 0x3F,
	0x42, 0x81, 0x98, 0x00, 0x20, 0x12, 0xDC, 0x07, 0xF7, 0xFF, 0x5E, 0x20,
	0x42, 0xB8, 0xFA, 0x37, 0x20, 0x00, 0xDB, 0x01, 0x20, 0x10, 0x82, 0x20,
	0xF7, 0xFF, 0x5E, 0x20, 0x46, 0x07, 0xFA, 0x2F, 0x5E, 0x20, 0x20, 0x12,
	0xFA, 0x2A, 0xF7, 0xFF, 0x46, 0x30, 0x46, 0x01, 0x42, 0x8F, 0x30, 0x20,
	0x21, 0x10, 0xDD, 0x08, 0x29, 0x00, 0x5E, 0x61, 0x21, 0x08, 0xDD, 0x01,
	0x21, 0x04, 0xE0, 0x00, 0xE0, 0x09, 0x77, 0x01, 0x5E, 0x61, 0x21, 0x12,
	0xDD, 0x01, 0x29, 0x00, 0xE7, 0xF7, 0x21, 0x02, 0xDA, 0x01, 0x29, 0x00,
	0xE7, 0xF3, 0x21, 0x01, 0x30, 0x40, 0x19, 0x70, 0x7E, 0x41, 0x1C, 0x6D,
	0x76, 0x01, 0xB2, 0xED, 0xD3, 0xF7, 0x2D, 0x02, 0x8F, 0xB0, 0x19, 0x71,
	0x76, 0x08, 0x31, 0x40, 0xBD, 0xF8, 0x20, 0x01, 0x46, 0x05, 0xB5, 0xF8,
	0x07, 0xC1, 0x6A, 0x00, 0x07, 0x80, 0xD0, 0x7C, 0x46, 0x28, 0xD4, 0x02,
	0xFD, 0x78, 0xF0, 0x00, 0x46, 0x2C, 0x69, 0x28, 0x34, 0x40, 0x01, 0x81,
	0xDB, 0x01, 0x29, 0x00, 0xD5, 0x2D, 0x01, 0x41, 0x5E, 0x61, 0x21, 0x00,
	0xD1, 0x04, 0x29, 0x00, 0x0F, 0x09, 0x05, 0x01, 0x1E, 0x49, 0x22, 0x32,
	0x80, 0x21, 0x43, 0x51, 0x0F, 0x11, 0x04, 0x02, 0x21, 0x02, 0xD0, 0x08,
	0x29, 0x00, 0x5E, 0x61, 0x0F, 0x11, 0xD1, 0x03, 0x1E, 0x49, 0x23, 0x32,
	0x80, 0x61, 0x43, 0x59, 0x0F, 0x01, 0x05, 0x00, 0x6A, 0xE8, 0x0F, 0x17,
	0x18, 0x86, 0x00, 0x8A, 0x06, 0x12, 0x8F, 0x2A, 0xD5, 0x03, 0x6B, 0x2A,
	0xFA, 0x49, 0xF7, 0xFF, 0xE0, 0x17, 0x81, 0x20, 0xFA, 0x14, 0xF7, 0xFF,
	0x46, 0x39, 0x81, 0x20, 0x6B, 0x6A, 0x46, 0x30, 0xFA, 0x0E, 0xF7, 0xFF,
	0xE0, 0x0D, 0x81, 0x60, 0xD5, 0x0B, 0x01, 0x01, 0x5E, 0x61, 0x21, 0x00,
	0xD1, 0x03, 0x29, 0x00, 0x0F, 0x01, 0x05, 0x00, 0x43, 0x41, 0x20, 0x1E,
	0x46, 0x28, 0x80, 0x21, 0xFB, 0x96, 0xF7, 0xFF, 0x07, 0x80, 0x8C, 0x28,
	0x68, 0xA0, 0xD4, 0x01, 0x6B, 0xA8, 0x64, 0x68, 0xD5, 0x2F, 0x06, 0x41,
	0x21, 0x0C, 0x26, 0x08, 0x5E, 0x61, 0x5F, 0xA6, 0x1A, 0x73, 0x22, 0x00,
	0x5E, 0x61, 0x21, 0x10, 0x49, 0x17, 0x40, 0x4B, 0xDA, 0x0A, 0x2B, 0x00,
	0x04, 0x07, 0x78, 0x0B, 0xB2, 0xDB, 0x1C, 0x5B, 0x70, 0x0B, 0x0E, 0x3F,
	0xD2, 0x03, 0x42, 0x9F, 0x80, 0xA6, 0x70, 0x0A, 0x70, 0x0A, 0xE0, 0x00,
	0x26, 0x0E, 0x23, 0x0A, 0x5F, 0xA6, 0x5E, 0xE3, 0x5F, 0xE7, 0x27, 0x12,
	0x40, 0x7E, 0x1B, 0x9E, 0x78, 0x4E, 0xD5, 0x0B, 0x1C, 0x76, 0x04, 0x00,
	0x0E, 0x00, 0xB2, 0xF6, 0x42, 0xB0, 0x70, 0x4E, 0x70, 0x4A, 0xD2, 0x04,
	0xE0, 0x01, 0x80, 0xE3, 0x70, 0x4A, 0xE0, 0x08, 0x64, 0xE8, 0x68, 0xA0,
	0xF7, 0xFF, 0x46, 0x28, 0x46, 0x28, 0xFD, 0x4F, 0xF9, 0x98, 0xF7, 0xFF,
	0x00, 0x00, 0xBD, 0xF8, 0x20, 0x00, 0x1B, 0x08, 0x69, 0x01, 0xB5, 0x70,
	0xD4, 0x2E, 0x01, 0x09, 0x4D, 0x17, 0x6B, 0x81, 0x06, 0x4A, 0x4E, 0x17,
	0xD5, 0x0F, 0x46, 0x04, 0x07, 0xC0, 0x8C, 0x20, 0x46, 0x20, 0xD0, 0x25,
	0xFE, 0xEE, 0xF7, 0xFF, 0xD0, 0x20, 0x28, 0x00, 0x64, 0x60, 0x6C, 0xA0,
	0x21, 0x01, 0x6A, 0x20, 0x43, 0xB0, 0x43, 0x28, 0xE0, 0x16, 0x03, 0x89,
	0x07, 0xC2, 0x6A, 0x20, 0x07, 0x80, 0xD1, 0x15, 0x03, 0xC8, 0xD5, 0x13,
	0x46, 0x20, 0xD5, 0x02, 0xFA, 0x0C, 0xF7, 0xFF, 0xF7, 0xFF, 0x46, 0x20,
	0x28, 0x00, 0xFE, 0xD7, 0x6A, 0x20, 0xD0, 0x09, 0x0F, 0x49, 0x05, 0x41,
	0x43, 0x28, 0xD1, 0x05, 0x21, 0x01, 0x43, 0xB0, 0x18, 0x40, 0x03, 0x49,
	0xBD, 0x70, 0x62, 0x20, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0xF0, 0x00,
	0x8A, 0x01, 0xB5, 0x10, 0x05, 0x08, 0x46, 0x04, 0x0F, 0x00, 0x04, 0x09,
	0x42, 0xC8, 0x0F, 0x09, 0x46, 0x20, 0xD0, 0x0B, 0xFF, 0x2C, 0xF7, 0xFF,
	0x28, 0x00, 0x6B, 0xA0, 0x46, 0x20, 0xDA, 0x02, 0xFE, 0x2A, 0xF7, 0xFF,
	0xF7, 0xFF, 0x46, 0x20, 0xBD, 0x10, 0xFF, 0xB3, 0x46, 0x04, 0xB5, 0xF8,
	0x05, 0x01, 0x8A, 0x00, 0x0F, 0x0D, 0x04, 0x00, 0x42, 0xF5, 0x0F, 0x06,
	0x68, 0x60, 0xD0, 0x24, 0x46, 0x2A, 0x90, 0x00, 0x68, 0x23, 0x46, 0x20,
	0xF7, 0xFF, 0x6A, 0xE1, 0x46, 0x07, 0xFB, 0x55, 0x90, 0x00, 0x68, 0xE0,
	0x00, 0xA9, 0x6A, 0xE0, 0x46, 0x32, 0x18, 0x41, 0x68, 0xA3, 0x46, 0x20,
	0xFB, 0x4A, 0xF7, 0xFF, 0xD0, 0x10, 0x2F, 0x00, 0xD0, 0x0E, 0x28, 0x00,
	0x02, 0x00, 0x69, 0x20, 0x8C, 0xE0, 0x0F, 0x01, 0xFA, 0x62, 0xF7, 0xFF,
	0x0C, 0x00, 0x04, 0x00, 0xD1, 0x03, 0x84, 0xE0, 0x21, 0x01, 0x6A, 0x20,
	0x62, 0x20, 0x43, 0x08, 0x20, 0x00, 0xBD, 0xF8, 0x6A, 0x20, 0x84, 0xE0,
	0x00, 0x40, 0x08, 0x40, 0xB5, 0xF8, 0xE7, 0xF7, 0x68, 0x21, 0x46, 0x04,
	0x01, 0x09, 0x20, 0x00, 0x2C, 0x00, 0x0F, 0x0B, 0x46, 0x22, 0xD0, 0x7D,
	0x25, 0x01, 0x32, 0x80, 0x21, 0x3C, 0xE0, 0x26, 0x19, 0x09, 0x43, 0x41,
	0x2E, 0x00, 0x68, 0xCE, 0x68, 0x8E, 0xD1, 0x01, 0x68, 0x16, 0x60, 0xCE,
	0x59, 0xF6, 0x00, 0x87, 0x42, 0xBE, 0x68, 0x8F, 0x68, 0x61, 0xDB, 0x08,
	0x0F, 0xB7, 0x07, 0x0E, 0x40, 0x86, 0x46, 0x2E, 0x07, 0xBE, 0x43, 0x37,
	0xE0, 0x09, 0x0F, 0x36, 0x42, 0x8E, 0x68, 0xC9, 0x68, 0x61, 0xDA, 0x0A,
	0x0F, 0xB7, 0x07, 0x0E, 0x40, 0x86, 0x46, 0x2E, 0x00, 0xBE, 0x43, 0xB7,
	0x43, 0xB9, 0x27, 0x0C, 0x60, 0x66, 0x43, 0x0E, 0xB2, 0xC0, 0x1C, 0x40,
	0xD3, 0xD6, 0x42, 0x98, 0x07, 0x00, 0x79, 0x20, 0xF7, 0xFF, 0x0F, 0x80,
	0x07, 0x00, 0xFA, 0x88, 0x68, 0x62, 0x0E, 0x01, 0x43, 0x82, 0x20, 0xF0,
	0x01, 0x02, 0x43, 0x11, 0x06, 0x09, 0x46, 0x08, 0x1A, 0x59, 0x0F, 0x09,
	0x43, 0x90, 0x07, 0x09, 0x43, 0x08, 0x0D, 0x09, 0x60, 0x60, 0x26, 0x38,
	0xD0, 0x02, 0x2B, 0x01, 0xD0, 0x09, 0x2B, 0x02, 0x68, 0x21, 0xE0, 0x25,
	0x08, 0xC9, 0x22, 0x08, 0x43, 0x29, 0x00, 0xC9, 0x43, 0x11, 0x43, 0xB1,
	0xE0, 0x1C, 0x60, 0x21, 0x08, 0xCA, 0x68, 0x21, 0x00, 0x89, 0x00, 0xD2,
	0xD0, 0x01, 0x0F, 0x89, 0xE0, 0x00, 0x21, 0x01, 0x43, 0x0A, 0x21, 0x02,
	0x43, 0xB1, 0x46, 0x11, 0x0F, 0x92, 0x60, 0x22, 0x22, 0x01, 0xD0, 0x01,
	0x22, 0x02, 0xE0, 0x00, 0x43, 0x11, 0x00, 0xD2, 0x0F, 0x52, 0x07, 0x4A,
	0x2A, 0x01, 0x60, 0x21, 0x06, 0x89, 0xD1, 0x03, 0x29, 0x01, 0x0F, 0x49,
	0x06, 0x01, 0xD0, 0x4D, 0x68, 0x21, 0x0F, 0x0A, 0x07, 0x4B, 0x25, 0xFF,
	0x03, 0x2D, 0x0F, 0x5B, 0xD3, 0x2D, 0x42, 0x9A, 0x03, 0x00, 0x05, 0x89,
	0x0E, 0x00, 0x0F, 0x09, 0xF9, 0xCE, 0xF7, 0xFF, 0xE0, 0x3C, 0xE0, 0x00,
	0x0B, 0x01, 0x06, 0x00, 0x43, 0xA8, 0x68, 0x60, 0x03, 0x01, 0x43, 0x08,
	0x0E, 0x09, 0x60, 0x60, 0x08, 0x80, 0xD1, 0x03, 0x1C, 0x40, 0x00, 0x80,
	0x05, 0x01, 0x60, 0x60, 0x68, 0x21, 0x0F, 0x0A, 0x06, 0x8B, 0x25, 0xFF,
	0x05, 0x2D, 0x0F, 0x5B, 0xD3, 0x27, 0x42, 0x9A, 0x01, 0x00, 0x04, 0x89,
	0x0E, 0x00, 0x0F, 0x09, 0xF9, 0xB0, 0xF7, 0xFF, 0x09, 0x01, 0x06, 0x00,
	0x43, 0xA8, 0x68, 0x60, 0x01, 0x01, 0x43, 0x08, 0x0E, 0x09, 0x60, 0x60,
	0xE0, 0x04, 0xD0, 0x02, 0xE7, 0xE3, 0x43, 0xA8, 0x00, 0x80, 0x08, 0x80,
	0x07, 0x81, 0x60, 0x60, 0x0F, 0x89, 0x00, 0xC2, 0x42, 0x91, 0x0F, 0xD2,
	0x21, 0x01, 0xD0, 0x03, 0x43, 0x08, 0x07, 0x49, 0x22, 0x01, 0x60, 0x60,
	0x07, 0x12, 0x46, 0x01, 0x43, 0x91, 0x07, 0xC0, 0x43, 0x01, 0x08, 0xC0,
	0xBD, 0xF8, 0x60, 0x61, 0xE7, 0xE9, 0x43, 0xA8, 0x4E, 0x1A, 0xB5, 0xF8,
	0x24, 0x00, 0x46, 0x05, 0x40, 0xA0, 0x20, 0x01, 0xD0, 0x28, 0x42, 0x28,
	0x30, 0xB1, 0x20, 0xFF, 0x19, 0x80, 0x43, 0x60, 0x32, 0x9D, 0x22, 0xFF,
	0x21, 0x00, 0x58, 0x12, 0x0E, 0x9F, 0x01, 0xD3, 0x27, 0x23, 0xD0, 0x07,
	0x58, 0x3F, 0x01, 0x3F, 0x06, 0x1B, 0x0E, 0x9B, 0xDB, 0x00, 0x42, 0x9F,
	0x03, 0x52, 0x21, 0x01, 0xD0, 0x07, 0x0E, 0x93, 0x01, 0x1B, 0x23, 0x23,
	0x58, 0x1B, 0x0E, 0x92, 0x42, 0x52, 0x06, 0x12, 0xDD, 0x01, 0x42, 0x93,
	0xD0, 0x03, 0x29, 0x00, 0xF0, 0x00, 0x46, 0x20, 0xE0, 0x04, 0xF8, 0xA1,
	0x21, 0x00, 0x22, 0x0B, 0x18, 0x80, 0x01, 0x92, 0x1C, 0x64, 0x72, 0x81,
	0xD3, 0xCF, 0x2C, 0x0C, 0x00, 0x00, 0xBD, 0xF8, 0x20, 0x00, 0x00, 0x00,
	0x31, 0xB1, 0x21, 0xFF, 0x49, 0x10, 0x43, 0x48, 0x18, 0x40, 0xB5, 0x10,
	0x01, 0xC9, 0x21, 0x05, 0x6B, 0x4A, 0x18, 0x41, 0x01, 0x09, 0x21, 0x23,
	0x21, 0xFF, 0x18, 0x43, 0x58, 0x09, 0x31, 0x9D, 0x30, 0xFF, 0x30, 0xFF,
	0x2A, 0x00, 0x30, 0x02, 0x05, 0xC9, 0xDD, 0x08, 0x2A, 0x0F, 0x0F, 0x0A,
	0x6B, 0x01, 0xD0, 0x03, 0xF0, 0x00, 0x6A, 0xC0, 0xBD, 0x10, 0xFE, 0xF9,
	0x0F, 0x4A, 0x06, 0xC9, 0xD1, 0xF6, 0x2A, 0x07, 0x00, 0x00, 0xBD, 0x10,
	0x20, 0x00, 0x00, 0x00, 0x24, 0x00, 0xB5, 0xF8, 0x46, 0x05, 0x4F, 0x0F,
	0x46, 0x30, 0x26, 0x01, 0x42, 0x28, 0x40, 0xA0, 0x46, 0x20, 0xD0, 0x13,
	0xF8, 0x18, 0xF0, 0x00, 0xD1, 0x02, 0x28, 0x00, 0xF0, 0x00, 0x46, 0x20,
	0x20, 0xFF, 0xF8, 0x87, 0x43, 0x60, 0x30, 0xB1, 0x19, 0xC0, 0x21, 0x05,
	0x18, 0x41, 0x01, 0xC9, 0x30, 0xFF, 0x30, 0xFF, 0x30, 0x02, 0x6B, 0x49,
	0x1C, 0x64, 0x63, 0x41, 0x2C, 0x0C, 0xB2, 0xE4, 0xBD, 0xF8, 0xD3, 0xE3,
	0x20, 0x00, 0x00, 0x00, 0x46, 0x02, 0xB5, 0x70, 0x48, 0x21, 0x21, 0x01,
	0x25, 0xFF, 0x40, 0x91, 0x35, 0xB1, 0x1F, 0xC4, 0x43, 0x6A, 0x3C, 0xF9,
	0x69, 0x83, 0x19, 0x14, 0x35, 0xFF, 0x1D, 0xE5, 0x40, 0x0B, 0x26, 0x00,
	0x2B, 0x00, 0x35, 0xFA, 0x6A, 0xEA, 0xD0, 0x06, 0x69, 0x82, 0x63, 0x2A,
	0x26, 0x01, 0x43, 0x8A, 0xE0, 0x28, 0x61, 0x82, 0x31, 0xFF, 0x46, 0x21,
	0x7E, 0x08, 0x31, 0x81, 0x0F, 0x10, 0x06, 0x02, 0x6D, 0x48, 0xD0, 0x21,
	0xD0, 0x04, 0x02, 0xC3, 0x0A, 0xC0, 0x02, 0xC0, 0x02, 0x80, 0x42, 0x40,
	0x6A, 0x88, 0xE0, 0x03, 0x08, 0x40, 0x02, 0xC0, 0x21, 0x05, 0x42, 0x40,
	0x18, 0x61, 0x01, 0xC9, 0x42, 0x81, 0x6B, 0x49, 0x48, 0x0A, 0xDA, 0x0A,
	0x18, 0x20, 0x0F, 0x11, 0xFB, 0xBE, 0xF0, 0x00, 0xD0, 0x08, 0x28, 0x00,
	0x26, 0x02, 0x6A, 0xE8, 0xE0, 0x04, 0x63, 0x28, 0x20, 0x00, 0x21, 0x0B,
	0x18, 0x61, 0x01, 0x89, 0x46, 0x30, 0x72, 0xC8, 0x00, 0x00, 0xBD, 0x70,
	0x20, 0x00, 0x01, 0x00, 0x00, 0x00, 0x02, 0xCB, 0x21, 0xFF, 0xB5, 0x70,
	0x4D, 0x11, 0x31, 0xB1, 0x19, 0x44, 0x43, 0x48, 0x30, 0xFF, 0x46, 0x20,
	0x46, 0x06, 0x30, 0x81, 0x04, 0xC0, 0x8B, 0x80, 0x20, 0x01, 0x0F, 0x81,
	0xB2, 0xC1, 0x40, 0x88, 0x18, 0x20, 0x48, 0x0B, 0xFB, 0x98, 0xF0, 0x00,
	0xD0, 0x0D, 0x28, 0x00, 0x6E, 0x71, 0x68, 0x28, 0x6B, 0xE9, 0x40, 0x08,
	0x63, 0xE8, 0x43, 0x08, 0x01, 0x80, 0x20, 0x0B, 0x7C, 0x88, 0x18, 0x21,
	0xD0, 0x01, 0x28, 0xFF, 0x74, 0x88, 0x1C, 0x40, 0x00, 0x00, 0xBD, 0x70,
	0x20, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02, 0xCA, 0x31, 0xB1, 0x21, 0xFF,
	0x43, 0x41, 0x4A, 0x10, 0x46, 0x19, 0x18, 0x8B, 0x31, 0xFF, 0xB5, 0x10,
	0x7F, 0x0A, 0x31, 0x81, 0xD0, 0x08, 0x07, 0xD2, 0x6D, 0x49, 0x6D, 0x0A,
	0x02, 0xC9, 0x02, 0xD2, 0x08, 0x52, 0x0A, 0xC9, 0x02, 0x89, 0x42, 0x49,
	0x6A, 0x89, 0xE0, 0x03, 0x08, 0x4A, 0x02, 0xC9, 0x24, 0x05, 0x49, 0x06,
	0x19, 0x1B, 0x01, 0xE4, 0x42, 0x93, 0x6B, 0x5B, 0x42, 0x8B, 0xDC, 0x03,
	0xF7, 0xFF, 0xDB, 0x01, 0xBD, 0x10, 0xFF, 0x1F, 0x20, 0x00, 0x00, 0x00,
	0x80, 0x00, 0x00, 0x01, 0x20, 0x00, 0xB5, 0xF1, 0x46, 0x04, 0xB0, 0x82,
	0x21, 0xFF, 0x90, 0x00, 0x31, 0xB1, 0x98, 0x02, 0x49, 0x14, 0x43, 0x48,
	0x90, 0x01, 0x18, 0x40, 0x30, 0x81, 0x30, 0xFF, 0x02, 0x86, 0x6C, 0xC0,
	0x20, 0x01, 0x25, 0x08, 0x40, 0xA8, 0x1E, 0x6D, 0x46, 0x07, 0x43, 0x04,
	0x46, 0x6A, 0x02, 0x21, 0xF0, 0x00, 0x98, 0x02, 0x98, 0x00, 0xF9, 0x1D,
	0xDA, 0x01, 0x42, 0xB0, 0xE0, 0x01, 0x43, 0xBC, 0xD0, 0x02, 0x42, 0xB0,
	0x2D, 0x00, 0xB2, 0x6D, 0x22, 0x00, 0xDC, 0xEB, 0x98, 0x02, 0x46, 0x21,
	0xF8, 0x30, 0xF0, 0x00, 0x22, 0x00, 0x99, 0x01, 0x31, 0x61, 0x31, 0xFF,
	0x75, 0x4C, 0x75, 0x0A, 0xBD, 0xFE, 0x75, 0x88, 0x20, 0x00, 0x00, 0x00,
	0x31, 0xB1, 0x21, 0xFF, 0x49, 0x05, 0x43, 0x48, 0x31, 0xFF, 0x18, 0x41,
	0x31, 0x02, 0x31, 0xFF, 0x66, 0x08, 0x6C, 0x08, 0x65, 0x48, 0x65, 0x08,
	0x47, 0x70, 0x66, 0x48, 0x20, 0x00, 0x00, 0x00, 0x31, 0xB1, 0x21, 0xFF,
	0x49, 0x08, 0x43, 0x48, 0x18, 0x42, 0xB5, 0x10, 0x30, 0xFF, 0x1D, 0xD0,
	0x24, 0x05, 0x30, 0xFA, 0x01, 0xE4, 0x23, 0x00, 0x6A, 0xC1, 0x19, 0x12,
	0x65, 0x81, 0x62, 0x53, 0x63, 0x01, 0x63, 0x43, 0xBD, 0x10, 0x63, 0x53,
	0x20, 0x00, 0x00, 0x00, 0x20, 0x00, 0xB5, 0xF7, 0x46, 0x04, 0xB0, 0x82,
	0x23, 0xFF, 0x90, 0x00, 0x33, 0xB1, 0x98, 0x02, 0x4B, 0x11, 0x43, 0x58,
	0x18, 0xC0, 0x25, 0x08, 0x30, 0x81, 0x30, 0xFF, 0x02, 0x86, 0x6C, 0xC0,
	0x43, 0x10, 0x02, 0x08, 0x1E, 0x69, 0x90, 0x01, 0x40, 0x88, 0x20, 0x01,
	0x43, 0x04, 0x46, 0x07, 0x04, 0x20, 0x99, 0x01, 0x46, 0x6A, 0x43, 0x01,
	0xF0, 0x00, 0x98, 0x02, 0x98, 0x00, 0xF8, 0xBF, 0xDA, 0x01, 0x42, 0xB0,
	0xE0, 0x01, 0x43, 0xBC, 0xD0, 0x01, 0x42, 0xB0, 0xD1, 0xEA, 0x1E, 0x6D,
	0xB0, 0x05, 0x46, 0x20, 0x00, 0x00, 0xBD, 0xF0, 0x20, 0x00, 0x00, 0x00,
	0x24, 0x00, 0xB5, 0xF8, 0x46, 0x05, 0x46, 0x0F, 0x46, 0x30, 0x26, 0x01,
	0x42, 0x28, 0x40, 0xA0, 0x2F, 0x00, 0xD0, 0x0B, 0x21, 0x01, 0xD0, 0x06,
	0xF0, 0x00, 0x46, 0x20, 0x46, 0x20, 0xF9, 0x1B, 0xFB, 0xC0, 0xF0, 0x00,
	0xF7, 0xFF, 0xB2, 0xE0, 0x1C, 0x64, 0xFF, 0x97, 0xD3, 0xEC, 0x2C, 0x0C,
	0x24, 0x00, 0x4F, 0x09, 0x40, 0xA0, 0x46, 0x30, 0xD0, 0x08, 0x42, 0x28,
	0x43, 0x81, 0x69, 0xF9, 0x61, 0xF9, 0x46, 0x20, 0xFE, 0x42, 0xF0, 0x00,
	0xF7, 0xFF, 0xB2, 0xE0, 0x1C, 0x64, 0xFF, 0x95, 0xD3, 0xEF, 0x2C, 0x0C,
	0x00, 0x00, 0xBD, 0xF8, 0x20, 0x00, 0x01, 0x00, 0xB0, 0x86, 0xB5, 0xF1,
	0x90, 0x00, 0x20, 0x00, 0x98, 0x06, 0x21, 0xFF, 0x43, 0x48, 0x31, 0xB1,
	0x18, 0x41, 0x49, 0x3B, 0x31, 0xFF, 0x91, 0x02, 0x6C, 0xC8, 0x31, 0x81,
	0x02, 0x86, 0x99, 0x02, 0x31, 0x01, 0x31, 0xFF, 0x20, 0x08, 0x6E, 0xC9,
	0x0E, 0x0B, 0x02, 0x09, 0x1E, 0x41, 0x22, 0x01, 0x40, 0x8C, 0x46, 0x14,
	0xD1, 0x02, 0x42, 0x23, 0x28, 0x01, 0xB2, 0x48, 0x21, 0x08, 0xDC, 0xF7,
	0x25, 0xC0, 0x1A, 0x09, 0x23, 0xFF, 0x40, 0xCD, 0x1E, 0x80, 0x40, 0xCB,
	0xB2, 0x47, 0x24, 0xFF, 0x90, 0x05, 0x04, 0x20, 0x93, 0x03, 0x02, 0x18,
	0xE0, 0x12, 0x90, 0x01, 0x40, 0xB8, 0x20, 0x01, 0x90, 0x04, 0x43, 0x05,
	0x98, 0x05, 0x99, 0x01, 0x43, 0x01, 0x43, 0x29, 0x98, 0x06, 0x46, 0x6A,
	0xF8, 0x48, 0xF0, 0x00, 0x42, 0xB0, 0x98, 0x00, 0x98, 0x04, 0xDD, 0x01,
	0x1E, 0x7F, 0x43, 0x85, 0x2F, 0x00, 0xB2, 0x7F, 0x98, 0x01, 0xDA, 0xEA,
	0x43, 0x28, 0x27, 0x07, 0x20, 0x01, 0x90, 0x01, 0x43, 0x84, 0x40, 0xB8,
	0x99, 0x01, 0x90, 0x04, 0x43, 0x01, 0x04, 0x20, 0x98, 0x06, 0x46, 0x6A,
	0xF8, 0x30, 0xF0, 0x00, 0x42, 0xB0, 0x98, 0x00, 0x98, 0x04, 0xDD, 0x01,
	0x1E, 0x7F, 0x43, 0x04, 0x2F, 0x01, 0xB2, 0x7F, 0x99, 0x01, 0xDA, 0xEB,
	0x43, 0x01, 0x04, 0x20, 0x98, 0x06, 0x46, 0x6A, 0xF8, 0x20, 0xF0, 0x00,
	0x1E, 0x64, 0x98, 0x00, 0x99, 0x01, 0x1B, 0x87, 0x43, 0x01, 0x04, 0x20,
	0x98, 0x06, 0x46, 0x6A, 0xF8, 0x16, 0xF0, 0x00, 0x1B, 0x80, 0x98, 0x00,
	0xDA, 0x00, 0x2F, 0x00, 0x28, 0x00, 0x42, 0x7F, 0x42, 0x40, 0xDA, 0x00,
	0xDA, 0x00, 0x42, 0x87, 0x98, 0x02, 0x1C, 0x64, 0x30, 0x61, 0x30, 0xFF,
	0x99, 0x03, 0x75, 0x05, 0x75, 0x84, 0x75, 0x41, 0xBD, 0xF0, 0xB0, 0x07,
	0x20, 0x00, 0x00, 0x00, 0x46, 0x06, 0xB5, 0xF8, 0x20, 0xFF, 0x46, 0x0F,
	0x46, 0x31, 0x30, 0xB1, 0x48, 0x11, 0x43, 0x41, 0x18, 0x0C, 0x46, 0x15,
	0x30, 0x81, 0x20, 0xFF, 0xB2, 0xC2, 0x5B, 0x00, 0x0E, 0x01, 0x04, 0x00,
	0xF0, 0x00, 0x46, 0x30, 0x46, 0x39, 0xFB, 0x61, 0xF7, 0xFE, 0x46, 0x30,
	0xF7, 0xFE, 0xFD, 0x5B, 0x48, 0x08, 0xFD, 0x95, 0x30, 0x80, 0x21, 0x00,
	0xBF, 0x30, 0x67, 0x41, 0x2B, 0x00, 0x6F, 0x43, 0x34, 0xFF, 0xD0, 0xFB,
	0x6F, 0x20, 0x34, 0x01, 0x03, 0x00, 0x46, 0x29, 0xF0, 0x00, 0x0F, 0x00,
	0xBD, 0xF8, 0xFB, 0xBF, 0x20, 0x00, 0x00, 0x00, 0x89, 0x88, 0x49, 0x07,
	0x0C, 0x00, 0x04, 0x00, 0x20, 0x01, 0xD1, 0x00, 0x0E, 0x0A, 0x69, 0xC9,
	0x0E, 0x09, 0xD0, 0x02, 0xD1, 0x00, 0x29, 0x03, 0x01, 0x40, 0x20, 0x01,
	0x00, 0x00, 0x47, 0x70, 0x20, 0x00, 0x00, 0x00, 0xB0, 0x82, 0xB5, 0xF1,
	0x4E, 0x1B, 0x24, 0x00, 0x25, 0x01, 0x94, 0x00, 0x40, 0xA5, 0x98, 0x02,
	0xD0, 0x2A, 0x42, 0x05, 0x30, 0xB1, 0x20, 0xFF, 0x19, 0x87, 0x43, 0x60,
	0x30, 0x69, 0x20, 0xFF, 0x06, 0x01, 0x59, 0xC0, 0xD0, 0x10, 0x0E, 0x09,
	0x28, 0x05, 0xB2, 0xC0, 0x28, 0x07, 0xD0, 0x09, 0x46, 0x6A, 0xD1, 0x0E,
	0x46, 0x20, 0x21, 0x00, 0xFF, 0xA4, 0xF7, 0xFF, 0x28, 0x00, 0x98, 0x00,
	0x46, 0x20, 0xDA, 0x03, 0xFF, 0x1C, 0xF7, 0xFF, 0x46, 0x20, 0xE0, 0x02,
	0xFE, 0x62, 0xF7, 0xFF, 0x21, 0x00, 0x6B, 0xF0, 0x63, 0xF0, 0x43, 0xA8,
	0x01, 0x80, 0x20, 0x0B, 0x74, 0xC1, 0x18, 0x38, 0x29, 0xFF, 0x7B, 0xC1,
	0x1C, 0x49, 0xD0, 0x01, 0x1C, 0x64, 0x73, 0xC1, 0xD3, 0xCC, 0x2C, 0x0C,
	0x00, 0x00, 0xBD, 0xFE, 0x20, 0x00, 0x00, 0x00, 0x46, 0x07, 0xB5, 0xF3,
	0x30, 0xB1, 0x20, 0xFF, 0x43, 0x41, 0x46, 0x39, 0xB0, 0x89, 0x48, 0x22,
	0x96, 0x08, 0x18, 0x0E, 0x36, 0x81, 0x36, 0xFF, 0x25, 0x01, 0x68, 0xF0,
	0x0F, 0x80, 0x01, 0x40, 0x24, 0x00, 0x40, 0x85, 0x46, 0x68, 0x21, 0x20,
	0xFA, 0x4B, 0xF7, 0xFE, 0xB2, 0xC2, 0x88, 0x30, 0x0E, 0x01, 0x04, 0x00,
	0xF0, 0x00, 0x46, 0x38, 0x9E, 0x08, 0xFA, 0xDD, 0x36, 0xFF, 0x46, 0x38,
	0x96, 0x08, 0x36, 0x01, 0xF7, 0xFE, 0x6F, 0x71, 0x4E, 0x13, 0xFC, 0xD3,
	0xE0, 0x18, 0x36, 0x80, 0xB2, 0xE9, 0xB2, 0xE2, 0xF7, 0xFF, 0xB2, 0xF8,
	0xF7, 0xFE, 0xF9, 0x63, 0x20, 0x00, 0xFD, 0x05, 0xF3, 0xBF, 0x67, 0x70,
	0xBF, 0x30, 0x8F, 0x4F, 0x28, 0x00, 0x6F, 0x70, 0x00, 0xA0, 0xD0, 0xF9,
	0x18, 0x41, 0x46, 0x69, 0x6F, 0x00, 0x98, 0x08, 0x0F, 0x00, 0x03, 0x00,
	0xFB, 0x2E, 0xF0, 0x00, 0x42, 0xAC, 0x1C, 0x64, 0xB2, 0xE9, 0xD3, 0xE4,
	0x46, 0x6B, 0xB2, 0xF8, 0xF7, 0xFF, 0x9A, 0x0A, 0xB0, 0x0B, 0xF8, 0x7F,
	0x00, 0x00, 0xBD, 0xF0, 0x20, 0x00, 0x00, 0x00, 0x23, 0x00, 0xB5, 0xFE,
	0x60, 0x03, 0x46, 0x0D, 0x60, 0x2B, 0x4F, 0x38, 0x68, 0x7C, 0x68, 0x3E,
	0x40, 0x34, 0x46, 0xB4, 0x43, 0x34, 0x6B, 0xFE, 0x46, 0x66, 0x63, 0xFC,
	0x60, 0x7B, 0x40, 0x34, 0x68, 0x11, 0x60, 0x04, 0x43, 0x21, 0x1D, 0xFE,
	0x36, 0xF9, 0x60, 0x11, 0x96, 0x00, 0x68, 0x3C, 0x43, 0xB4, 0x68, 0xB6,
	0x60, 0x14, 0x43, 0x0C, 0x31, 0xB1, 0x21, 0xFF, 0x19, 0xC9, 0x43, 0x59,
	0x34, 0x6D, 0x24, 0xFF, 0x0F, 0x34, 0x58, 0x66, 0x24, 0x0B, 0xD0, 0x0D,
	0x19, 0x09, 0x01, 0xA4, 0x0F, 0x36, 0x7C, 0xCC, 0xD2, 0x06, 0x42, 0xB4,
	0x74, 0xCC, 0x1C, 0x64, 0x68, 0x14, 0x21, 0x01, 0x43, 0x0C, 0x40, 0x99,
	0x1C, 0x5B, 0x60, 0x14, 0xD3, 0xE5, 0x2B, 0x0C, 0x68, 0x00, 0x68, 0x11,
	0x43, 0xC8, 0x43, 0x01, 0x40, 0x08, 0x68, 0x39, 0x90, 0x01, 0x24, 0x00,
	0x98, 0x01, 0x26, 0x01, 0x42, 0x06, 0x40, 0xA6, 0x69, 0xF8, 0xD0, 0x1F,
	0x28, 0x01, 0x0E, 0x00, 0xD0, 0x13, 0x48, 0x18, 0x19, 0xC0, 0x43, 0x60,
	0x30, 0x01, 0x30, 0xFF, 0x02, 0x00, 0x6E, 0x80, 0x48, 0x14, 0x0E, 0x01,
	0x43, 0x60, 0x4A, 0x14, 0x18, 0x80, 0x19, 0xC0, 0xF9, 0x04, 0xF0, 0x00,
	0xD0, 0x12, 0x28, 0x00, 0x43, 0x30, 0x68, 0x28, 0xE0, 0x0E, 0x60, 0x28,
	0x19, 0xC0, 0x43, 0x60, 0x30, 0x01, 0x30, 0xFF, 0x04, 0x00, 0x6E, 0x80,
